package L01;

public class _08_loops {

    /*
    לולאות מאפשרות לנו לחזור על קוד מסוים כמה פעמים עד שתנאי מסוים מתקיים.

    ישנם 3 סוגי לולאות בשפת ג'אווה:
    1. לולאת while
    2. לולאת do-while
    3. לולאת for
     */

    public static void main(String[] args) {
        // לולאת while
        // כל עוד התנאי מתקיים הלולאה תמשיך לרוץ
        int i = 0;
        while (i < 5) {
            System.out.println(i);
            i++;
        }

        // לולאת do-while
        // הלולאה תרוץ לפחות פעם אחת ורק אז תבדוק את התנאי
        int j = 0;
        do {
            System.out.println(j);
            j++;
        } while (j < 5);

        // לולאת for
        // נועדה ללולאות עם מספר פעמים קבוע
        for (int k = 0; k < 5; k++) {
            System.out.println(k);
        }


        // הדפסה של משולש הפוך
        for (int k = 5; k > 0; k--) {
            for (int l = 0; l < k; l++) {
                System.out.print("*");
            }
            System.out.println();
        }

        /*
        לולאות for בנויות משלושה חלקים:
        1. חלק התחלה - כאן אנחנו מאתחלים משתנים
        2. חלק תנאי - כאן אנחנו מציינים את התנאי שבו נמשיך לרוץ בלולאה
        3. חלק צעד - כאן אנחנו מגדילים או מקטנים את המשתנה שבתנאי

        החלקים מופרדים ב- ;
         */
    }
}
